tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65j50_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F65J50_H_
#define _PIC18F65J50_H_

#define PMSTATL                       0
#define OB0E                          1
#define OB1E                          2
#define OB2E                          3
#define OB3E                          4
#define OBUF                          5
#define OBE                           6
#define PMSTATH                       7
#define IB0F                          8
#define IB1F                          9
#define IB2F                          10
#define IB3F                          11
#define IBOV                          12
#define IBF                           13
#define PMEL                          14
#define PTEN0                         15
#define PTENL                         16
#define PTEN1                         17
#define PTEN2                         18
#define PTEN3                         19
#define PTEN4                         20
#define PTEN5                         21
#define PTEN6                         22
#define PTEN7                         23
#define PMEH                          24
#define PTEN8                         25
#define PTENH                         26
#define PTEN9                         27
#define PTEN10                        28
#define PTEN11                        29
#define PTEN12                        30
#define PTEN13                        31
#define PTEN14                        32
#define PTEN15                        33
#define PMMODEL                       34
#define WAITE0                        35
#define WAITE                         36
#define WAITE1                        37
#define WAITM0                        38
#define WAITM                         39
#define WAITM1                        40
#define WAITM2                        41
#define WAITM3                        42
#define WAITB0                        43
#define WAITB                         44
#define WAITB1                        45
#define PMMODEH                       46
#define MODE0                         47
#define MODE                          48
#define MODE1                         49
#define MODE16                        50
#define INCM                          51
#define INCM0                         52
#define INCM1                         53
#define IRQM0                         54
#define IRQM                          55
#define IRQM1                         56
#define BUSY                          57
#define PMCONL                        58
#define RDSP                          59
#define WRSP                          60
#define BEP                           61
#define CS1P                          62
#define CS2P                          63
#define ALP                           64
#define CSF0                          65
#define CSF1                          66
#define PMCONH                        67
#define PTRDEN                        68
#define PTWREN                        69
#define PTBEEN                        70
#define ADRMUX0                       71
#define ADRMUX1                       72
#define PSIDL                         73
#define PMPEN                         74
#define UEP0                          75
#define UEP0_EPSTALL                  76
#define EP0STALL                      77
#define EPSTALL0                      78
#define UEP0_EPINEN                   79
#define EPINEN0                       80
#define EP0INEN                       81
#define UEP0_EPOUTEN                  82
#define EP0OUTEN                      83
#define EPOUTEN0                      84
#define EPCONDIS0                     85
#define EP0CONDIS                     86
#define UEP0_EPCONDIS                 87
#define UEP0_EPHSHK                   88
#define EP0HSHK                       89
#define EPHSHK0                       90
#define UEP1                          91
#define EPSTALL1                      92
#define EP1STALL                      93
#define UEP1_EPSTALL                  94
#define EPINEN1                       95
#define EP1INEN                       96
#define UEP1_EPINEN                   97
#define EPOUTEN1                      98
#define UEP1_EPOUTEN                  99
#define EP1OUTEN                      100
#define UEP1_EPCONDIS                 101
#define EP1CONDIS                     102
#define EPCONDIS1                     103
#define EPHSHK1                       104
#define EP1HSHK                       105
#define UEP1_EPHSHK                   106
#define UEP2                          107
#define EP2STALL                      108
#define EPSTALL2                      109
#define UEP2_EPSTALL                  110
#define EP2INEN                       111
#define EPINEN2                       112
#define UEP2_EPINEN                   113
#define EP2OUTEN                      114
#define UEP2_EPOUTEN                  115
#define EPOUTEN2                      116
#define EP2CONDIS                     117
#define UEP2_EPCONDIS                 118
#define EPCONDIS2                     119
#define EP2HSHK                       120
#define EPHSHK2                       121
#define UEP2_EPHSHK                   122
#define UEP3                          123
#define UEP3_EPSTALL                  124
#define EPSTALL3                      125
#define EP3STALL                      126
#define UEP3_EPINEN                   127
#define EPINEN3                       128
#define EP3INEN                       129
#define EP3OUTEN                      130
#define EPOUTEN3                      131
#define UEP3_EPOUTEN                  132
#define UEP3_EPCONDIS                 133
#define EP3CONDIS                     134
#define EPCONDIS3                     135
#define EPHSHK3                       136
#define UEP3_EPHSHK                   137
#define EP3HSHK                       138
#define UEP4                          139
#define EP4STALL                      140
#define EPSTALL4                      141
#define UEP4_EPSTALL                  142
#define UEP4_EPINEN                   143
#define EP4INEN                       144
#define EPINEN4                       145
#define UEP4_EPOUTEN                  146
#define EPOUTEN4                      147
#define EP4OUTEN                      148
#define EPCONDIS4                     149
#define EP4CONDIS                     150
#define UEP4_EPCONDIS                 151
#define EPHSHK4                       152
#define EP4HSHK                       153
#define UEP4_EPHSHK                   154
#define UEP5                          155
#define EP5STALL                      156
#define UEP5_EPSTALL                  157
#define EPSTALL5                      158
#define EPINEN5                       159
#define UEP5_EPINEN                   160
#define EP5INEN                       161
#define EPOUTEN5                      162
#define UEP5_EPOUTEN                  163
#define EP5OUTEN                      164
#define EPCONDIS5                     165
#define EP5CONDIS                     166
#define UEP5_EPCONDIS                 167
#define UEP5_EPHSHK                   168
#define EPHSHK5                       169
#define EP5HSHK                       170
#define UEP6                          171
#define EPSTALL6                      172
#define UEP6_EPSTALL                  173
#define EP6STALL                      174
#define EP6INEN                       175
#define UEP6_EPINEN                   176
#define EPINEN6                       177
#define EP6OUTEN                      178
#define EPOUTEN6                      179
#define UEP6_EPOUTEN                  180
#define UEP6_EPCONDIS                 181
#define EP6CONDIS                     182
#define EPCONDIS6                     183
#define EPHSHK6                       184
#define UEP6_EPHSHK                   185
#define EP6HSHK                       186
#define UEP7                          187
#define UEP7_EPSTALL                  188
#define EP7STALL                      189
#define EPSTALL7                      190
#define EP7INEN                       191
#define EPINEN7                       192
#define UEP7_EPINEN                   193
#define EP7OUTEN                      194
#define UEP7_EPOUTEN                  195
#define EPOUTEN7                      196
#define UEP7_EPCONDIS                 197
#define EP7CONDIS                     198
#define EPCONDIS7                     199
#define EPHSHK7                       200
#define UEP7_EPHSHK                   201
#define EP7HSHK                       202
#define UEP8                          203
#define EPSTALL8                      204
#define UEP8_EPSTALL                  205
#define UEP8_EPINEN                   206
#define EPINEN8                       207
#define UEP8_EPOUTEN                  208
#define EPOUTEN8                      209
#define UEP8_EPCONDIS                 210
#define EPCONDIS8                     211
#define UEP8_EPHSHK                   212
#define EPHSHK8                       213
#define UEP9                          214
#define EPSTALL9                      215
#define UEP9_EPSTALL                  216
#define EPINEN9                       217
#define UEP9_EPINEN                   218
#define UEP9_EPOUTEN                  219
#define EPOUTEN9                      220
#define UEP9_EPCONDIS                 221
#define EPCONDIS9                     222
#define UEP9_EPHSHK                   223
#define EPHSHK9                       224
#define UEP10                         225
#define EPSTALL10                     226
#define UEP10_EPSTALL                 227
#define EPINEN10                      228
#define UEP10_EPINEN                  229
#define UEP10_EPOUTEN                 230
#define EPOUTEN10                     231
#define EPCONDIS10                    232
#define UEP10_EPCONDIS                233
#define UEP10_EPHSHK                  234
#define EPHSHK10                      235
#define UEP11                         236
#define UEP11_EPSTALL                 237
#define EPSTALL11                     238
#define EPINEN11                      239
#define UEP11_EPINEN                  240
#define UEP11_EPOUTEN                 241
#define EPOUTEN11                     242
#define EPCONDIS11                    243
#define UEP11_EPCONDIS                244
#define UEP11_EPHSHK                  245
#define EPHSHK11                      246
#define UEP12                         247
#define EPSTALL12                     248
#define UEP12_EPSTALL                 249
#define UEP12_EPINEN                  250
#define EPINEN12                      251
#define EPOUTEN12                     252
#define UEP12_EPOUTEN                 253
#define EPCONDIS12                    254
#define UEP12_EPCONDIS                255
#define EPHSHK12                      256
#define UEP12_EPHSHK                  257
#define UEP13                         258
#define UEP13_EPSTALL                 259
#define EPSTALL13                     260
#define EPINEN13                      261
#define UEP13_EPINEN                  262
#define UEP13_EPOUTEN                 263
#define EPOUTEN13                     264
#define EPCONDIS13                    265
#define UEP13_EPCONDIS                266
#define EPHSHK13                      267
#define UEP13_EPHSHK                  268
#define UEP14                         269
#define UEP14_EPSTALL                 270
#define EPSTALL14                     271
#define EPINEN14                      272
#define UEP14_EPINEN                  273
#define UEP14_EPOUTEN                 274
#define EPOUTEN14                     275
#define EPCONDIS14                    276
#define UEP14_EPCONDIS                277
#define UEP14_EPHSHK                  278
#define EPHSHK14                      279
#define UEP15                         280
#define UEP15_EPSTALL                 281
#define EPSTALL15                     282
#define UEP15_EPINEN                  283
#define EPINEN15                      284
#define UEP15_EPOUTEN                 285
#define EPOUTEN15                     286
#define EPCONDIS15                    287
#define UEP15_EPCONDIS                288
#define UEP15_EPHSHK                  289
#define EPHSHK15                      290
#define UIE                           291
#define URSTIE                        292
#define UERRIE                        293
#define ACTVIE                        294
#define TRNIE                         295
#define IDLEIE                        296
#define STALLIE                       297
#define SOFIE                         298
#define UEIE                          299
#define PIDEE                         300
#define CRC5EE                        301
#define CRC16EE                       302
#define DFN8EE                        303
#define BTOEE                         304
#define BTSEE                         305
#define UADDR                         306
#define ADDR                          307
#define ADDR0                         308
#define ADDR1                         309
#define ADDR2                         310
#define ADDR3                         311
#define ADDR4                         312
#define ADDR5                         313
#define ADDR6                         314
#define UCFG                          315
#define PPB                           316
#define UPP0                          317
#define PPB0                          318
#define UPP1                          319
#define PPB1                          320
#define FSEN                          321
#define UTRDIS                        322
#define UPUEN                         323
#define UOEMON                        324
#define UTEYE                         325
#define UFRML                         326
#define FRML                          327
#define FRM0                          328
#define UFRML_FRM                     329
#define FRM1                          330
#define FRM2                          331
#define FRM3                          332
#define FRM4                          333
#define FRM5                          334
#define FRM6                          335
#define FRM7                          336
#define UFRMH                         337
#define FRM8                          338
#define UFRMH_FRM                     339
#define FRM9                          340
#define FRM10                         341
#define UIR                           342
#define URSTIF                        343
#define UERRIF                        344
#define ACTVIF                        345
#define TRNIF                         346
#define IDLEIF                        347
#define STALLIF                       348
#define SOFIF                         349
#define UEIR                          350
#define PIDEF                         351
#define CRC5EF                        352
#define CRC16EF                       353
#define DFN8EF                        354
#define BTOEF                         355
#define BTSEF                         356
#define USTAT                         357
#define PPBI                          358
#define DIR                           359
#define ENDP                          360
#define ENDP0                         361
#define ENDP1                         362
#define ENDP2                         363
#define ENDP3                         364
#define UCON                          365
#define SUSPND                        366
#define RESUME                        367
#define USBEN                         368
#define PKTDIS                        369
#define SE0                           370
#define PPBRST                        371
#define PMADDRH                       372
#define ADDRH                         373
#define CS1                           374
#define CS2                           375
#define CMSTAT                        376
#define COUT1                         377
#define COUT2                         378
#define SSP2CON2                      379
#define SEN2                          380
#define SSP2CON2_SEN                  381
#define ADMSK12                       382
#define SSP2CON2_RSEN                 383
#define RSEN2                         384
#define SSP2CON2_ADMSK1               385
#define ADMSK22                       386
#define PEN2                          387
#define SSP2CON2_PEN                  388
#define SSP2CON2_ADMSK2               389
#define ADMSK32                       390
#define SSP2CON2_RCEN                 391
#define RCEN2                         392
#define SSP2CON2_ADMSK3               393
#define ACKEN2                        394
#define ADMSK42                       395
#define SSP2CON2_ADMSK4               396
#define SSP2CON2_ACKEN                397
#define ACKDT2                        398
#define ADMSK52                       399
#define SSP2CON2_ACKDT                400
#define SSP2CON2_ADMSK5               401
#define SSP2CON2_ACKSTAT              402
#define ACKSTAT2                      403
#define SSP2CON2_GCEN                 404
#define GCEN2                         405
#define SSP2CON1                      406
#define SSP2CON1_SSPM                 407
#define SSP2CON1_SSPM0                408
#define SSPM02                        409
#define SSPM12                        410
#define SSP2CON1_SSPM1                411
#define SSP2CON1_SSPM2                412
#define SSPM22                        413
#define SSPM32                        414
#define SSP2CON1_SSPM3                415
#define SSP2CON1_CKP                  416
#define CKP2                          417
#define SSPEN2                        418
#define SSP2CON1_SSPEN                419
#define SSPOV2                        420
#define SSP2CON1_SSPOV                421
#define WCOL2                         422
#define SSP2CON1_WCOL                 423
#define SSP2STAT                      424
#define SSP2STAT_BF                   425
#define BF2                           426
#define SSP2STAT_UA                   427
#define UA2                           428
#define SSP2STAT_R_W                  429
#define RW2                           430
#define SSP2STAT_R                    431
#define SSP2STAT_nWRITE               432
#define SSP2STAT_nW                   433
#define READ_WRITE2                   434
#define nW2                           435
#define SSP2STAT_I2C_READ             436
#define I2C_READ2                     437
#define SSP2STAT_R_NOT_W              438
#define R_nW2                         439
#define SSP2STAT_READ_WRITE           440
#define nWRITE2                       441
#define R_W2                          442
#define SSP2STAT_R_nW                 443
#define SSP2STAT_NOT_WRITE            444
#define SSP2STAT_S                    445
#define S2                            446
#define START2                        447
#define SSP2STAT_I2C_START            448
#define I2C_START2                    449
#define P2                            450
#define SSP2STAT_I2C_STOP             451
#define STOP2                         452
#define SSP2STAT_P                    453
#define I2C_STOP2                     454
#define I2C_DAT2                      455
#define SSP2STAT_D                    456
#define DATA_ADDRESS2                 457
#define SSP2STAT_D_NOT_A              458
#define SSP2STAT_I2C_DAT              459
#define D_A2                          460
#define SSP2STAT_NOT_ADDRESS          461
#define SSP2STAT_D_nA                 462
#define SSP2STAT_DATA_ADDRESS         463
#define SSP2STAT_nADDRESS             464
#define nA2                           465
#define DA2                           466
#define nADDRESS2                     467
#define SSP2STAT_nA                   468
#define SSP2STAT_D_A                  469
#define D_nA2                         470
#define SSP2STAT_CKE                  471
#define CKE2                          472
#define SSP2STAT_SMP                  473
#define SMP2                          474
#define SSP2ADD                       475
#define MSK02                         476
#define MSK12                         477
#define MSK22                         478
#define MSK32                         479
#define MSK42                         480
#define MSK52                         481
#define MSK62                         482
#define MSK72                         483
#define SSP2MSK                       484
#define SSP2MSK_MSK0                  485
#define SSP2MSK_MSK1                  486
#define SSP2MSK_MSK2                  487
#define SSP2MSK_MSK3                  488
#define SSP2MSK_MSK4                  489
#define SSP2MSK_MSK5                  490
#define SSP2MSK_MSK6                  491
#define SSP2MSK_MSK7                  492
#define CCP5CON                       493
#define CCP5M0                        494
#define CCP5M                         495
#define CCP5M1                        496
#define CCP5M2                        497
#define CCP5M3                        498
#define DCCP5Y                        499
#define DC5B0                         500
#define DC5B                          501
#define DC5Y                          502
#define DC5B1                         503
#define DCCP5X                        504
#define DC5X                          505
#define CCP4CON                       506
#define CCP4M                         507
#define CCP4M0                        508
#define CCP4M1                        509
#define CCP4M2                        510
#define CCP4M3                        511
#define DCCP4Y                        512
#define DC4B0                         513
#define DC4B                          514
#define DC4Y                          515
#define DCCP4X                        516
#define DC4X                          517
#define DC4B1                         518
#define T4CON                         519
#define T4CKPS0                       520
#define T4CKPS                        521
